/*
 *  linux/drivers/serial/tmpa910_fw.c
 *
 *  Based on drivers/serial/pxa.c by Nicolas Pitre
 *
 *  Author:	Nicolas 
 *  Created:	Feb 20, 2003
 *  Copyright:	(C) 2008 bplan GmbH
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *

 */


/*********/
/*********/
#include <linux/module.h>
#include <linux/ioport.h>
#include <linux/init.h>
#include <linux/console.h>
#include <linux/sysrq.h>
#include <linux/serial_reg.h>
#include <linux/circ_buf.h>
#include <linux/delay.h>
#include <linux/interrupt.h>
#include <linux/platform_device.h>
#include <linux/tty.h>
#include <linux/tty_flip.h>
#include <linux/serial_core.h>
#include <linux/ioport.h>


#include <asm/io.h>
#include <mach/hardware.h>
#include <asm/irq.h>
/*********/
/*********/


#define DRIVER_NAME  	"tmpa910_uart"

#define TMPA910_UART_REGSIZE 0x50
#define TMPA910_SERIAL_MAX 2
#define TMPA910_NAME_PATTERN  "TMPA910 UART Channel %d"
/*********/
/*********/
struct tmpa910_uart_regs
{
  uint32_t dr;      // 0x000
  uint32_t sr;     // 0x004
  uint32_t ecr;     // 0x004
  uint32_t rsd1[3]; // 0x008 -> 0x014
  uint32_t fr;      // 0x018
  uint32_t rsd2;    // 0x01c
  uint32_t ilpr;    // 0x020
  uint32_t ibrd;    // 0x024
  uint32_t fbrd;    // 0x028
  uint32_t lcr_h;   // 0x02c
  uint32_t cr;      // 0x030
  uint32_t ifls;    // 0x034
  uint32_t imsc;    // 0x038
  uint32_t ris;     // 0x03c
  uint32_t mis;     // 0x040
  uint32_t icr;     // 0x044
  uint32_t dmacr;   // 0x048
};
/*********/
/*********/
// The data register contains 8bit for the char and 4 status bits

#define DR_OE  (1<<11)  // OE RO Undefined Overrun error
                        // 0y0: There is an empty space in the FIFO.
                        // 0y1: Overrun error flag
#define DR_BE  (1<<10)  // BE RO Undefined Break error
                        // 0y0: No error detected
                        // 0y1: Error detected
#define DR_PE  (1<<9)   // PE RO Undefined Parity error
                        // 0y0: No error detected
                        // 0y1: Error detected
#define DR_FE  (1<<8)   // FE RO Undefined Framing error
                        // 0y0: No error detected
                        // 0y1: Error detected
/*********/
/*********/
// The data register contains 8bit for the char and 4 status bits

#define SR_OE  (1<<3)  
#define SR_BE  (1<<2) 
#define SR_PE  (1<<1) 
#define SR_FE  (1<<0)

/*********/
/*********/

